lkolbly/cmsis-svd/data/Atmel/ATSAML21G17A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP</name>
      <version>1.0.0</version>
      <description>Operational Amplifier</description>
      <groupName>OPAMP</groupName>
      <prependToName>OPAMP_</prependToName>
      <baseAddress>0x43001800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMUX</name>
              <description>Low-Power Mux</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OPAMPCTRL%s</name>
          <description>OPAMP n Control</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Operational Amplifier Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANAOUT</name>
              <description>Analog Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIAS</name>
              <description>Bias Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RES2OUT</name>
              <description>Resistor ladder To Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RES2VCC</name>
              <description>Resistor ladder To VCC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RES1EN</name>
              <description>Resistor 1 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RES1MUX</name>
              <description>Resistor 1 Mux</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>POTMUX</name>
              <description>Potentiometer Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>Positive Input Mux Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>Negative Input Mux Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY0</name>
              <description>OPAMP 0 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>READY1</name>
              <description>OPAMP 1 Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>READY2</name>
              <description>OPAMP 2 Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OSCCTRL</name>
      <version>1.1.0</version>
      <description>Oscillators Control</description>
      <groupName>OSCCTRL</groupName>
      <prependToName>OSCCTRL_</prependToName>
      <baseAddress>0x40000C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSTEM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>DFLLCTRL</name>
          <description>DFLL48M Control</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <resetValue>0x0080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DFLL Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STABLE</name>
              <description>Stable DFLL Frequency</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLAW</name>
              <description>Lose Lock After Wake</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBCRM</name>
              <description>USB Clock Recovery Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCDIS</name>
              <description>Chill Cycle Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QLDIS</name>
              <description>Quick Lock Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BPLCKC</name>
              <description>Bypass Coarse Lock</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITLOCK</name>
              <description>Wait Lock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLMUL</name>
          <description>DFLL48M Multiplier</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUL</name>
              <description>DFLL Multiply Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FSTEP</name>
              <description>Fine Maximum Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CSTEP</name>
              <description>Coarse Maximum Step</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLSYNC</name>
          <description>DFLL48M Synchronization</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>READREQ</name>
              <description>Read Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLVAL</name>
          <description>DFLL48M Value</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIFF</name>
              <description>Multiplication Ratio Difference</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLCTRLA</name>
          <description>DPLL Control</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLCTRLB</name>
          <description>Digital Core Configuration</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FILTER</name>
              <description>Proportional Integral Filter Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPEN</name>
              <description>Low-Power Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF</name>
              <description>Wake Up Fast</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFCLK</name>
              <description>Reference Clock Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LTIME</name>
              <description>Lock Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LBYPASS</name>
              <description>Lock Bypass</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIV</name>
              <description>Clock Divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLPRESC</name>
          <description>DPLL Prescaler</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PRESC</name>
              <description>Output Clock Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PRESCSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>DPLL output is divided by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>DPLL output is divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>DPLL output is divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLRATIO</name>
          <description>DPLL Ratio Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LDR</name>
              <description>Loop Divider Ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LDRFRAC</name>
              <description>Loop Divider Ratio Fractional Part</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLSTATUS</name>
          <description>DPLL Status</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOCK</name>
              <description>DPLL Lock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKRDY</name>
              <description>DPLL Clock Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLSYNCBUSY</name>
          <description>DPLL Synchronization Busy</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DPLL Enable Synchronization Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPLLRATIO</name>
              <description>DPLL Ratio Synchronization Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPLLPRESC</name>
              <description>DPLL Prescaler Synchronization Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSCRDY</name>
              <description>XOSC Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC16MRDY</name>
              <description>OSC16M Ready Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLRDY</name>
              <description>DFLL Ready Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLOOB</name>
              <description>DFLL Out Of Bounds Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLLCKF</name>
              <description>DFLL Lock Fine Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLLCKC</name>
              <description>DFLL Lock Coarse Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLRCS</name>
              <description>DFLL Reference Clock Stopped Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLCKR</name>
              <description>DPLL Lock Rise Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLCKF</name>
              <description>DPLL Lock Fall Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLTO</name>
              <description>DPLL Time Out Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLDRTO</name>
              <description>DPLL Ratio Ready Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSCRDY</name>
              <description>XOSC Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC16MRDY</name>
              <description>OSC16M Ready Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLRDY</name>
              <description>DFLL Ready Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLOOB</name>
              <description>DFLL Out Of Bounds Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLLCKF</name>
              <description>DFLL Lock Fine Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLLCKC</name>
              <description>DFLL Lock Coarse Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLRCS</name>
              <description>DFLL Reference Clock Stopped Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLCKR</name>
              <description>DPLL Lock Rise Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLCKF</name>
              <description>DPLL Lock Fall Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLTO</name>
              <description>DPLL Time Out Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPLLLDRTO</name>
              <description>DPLL Ratio Ready Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
