lkolbly/cmsis-svd/data/Atmel/ATSAML21G17A.svd
        <register>
          <name>VREF</name>
          <description>VREF Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSEN</name>
              <description>Temperature Sensor Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFOE</name>
              <description>Voltage Reference Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Contrl</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEL</name>
              <description>Voltage Reference Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>1V0</name>
                  <description>1.0V voltage reference typical value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>1.1V voltage reference typical value</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V2</name>
                  <description>1.2V voltage reference typical value</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V25</name>
                  <description>1.25V voltage reference typical value</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V0</name>
                  <description>2.0V voltage reference typical value</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V2</name>
                  <description>2.2V voltage reference typical value</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V4</name>
                  <description>2.4V voltage reference typical value</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>2.5V voltage reference typical value</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VREG</name>
          <description>VREG Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEL</name>
              <description>Voltage Regulator Selection in active mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>LDO selection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Buck selection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCVREG</name>
                  <description>Switched Cap selection</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPEFF</name>
              <description>Low Power Efficiency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSVSTEP</name>
              <description>Voltage Scaling Voltage Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSPER</name>
              <description>Voltage Scaling Period</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TAL</name>
      <version>1.0.2</version>
      <description>Trigger Allocator</description>
      <groupName>TAL</groupName>
      <prependToName>TAL_</prependToName>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSTEM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>BRKSTATUS</name>
          <description>Break Request Status</description>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Request</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>CTICTRLA%s</name>
          <description>Cross-Trigger Interface n Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ACTION</name>
              <description>Action when global break issued</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACTIONSelect</name>
                <enumeratedValue>
                  <name>BREAK</name>
                  <description>Break when requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Trigger DBG interrupt instead of break</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>Ignore break request</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>Action when global restart issued</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>CTIMASK%s</name>
          <description>Cross-Trigger Interface n Mask</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Master</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACPUSEL0</name>
          <description>DMA Channel Interrupts CPU Select 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>DMA Channel 0 Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>DMA Channel 1 Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2</name>
              <description>DMA Channel 2 Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3</name>
              <description>DMA Channel 3 Interrupt CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>DMA Channel 4 Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>DMA Channel 5 Interrupt CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>DMA Channel 6 Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>DMA Channel 7 Interrupt CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH8</name>
              <description>DMA Channel 8 Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH9</name>
              <description>DMA Channel 9 Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH10</name>
              <description>DMA Channel 10 Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH11</name>
              <description>DMA Channel 11 Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH12</name>
              <description>DMA Channel 12 Interrupt CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH13</name>
              <description>DMA Channel 13 Interrupt CPU Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH14</name>
              <description>DMA Channel 14 Interrupt CPU Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH15</name>
              <description>DMA Channel 15 Interrupt CPU Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EICCPUSEL0</name>
          <description>EIC External Interrupts CPU Select 0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXTINT0</name>
              <description>External Interrupt 0 CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT1</name>
              <description>External Interrupt 1 CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT2</name>
              <description>External Interrupt 2 CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT3</name>
              <description>External Interrupt 3 CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT4</name>
              <description>External Interrupt 4 CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT5</name>
              <description>External Interrupt 5 CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT6</name>
              <description>External Interrupt 6 CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT7</name>
              <description>External Interrupt 7 CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT8</name>
              <description>External Interrupt 8 CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT9</name>
              <description>External Interrupt 9 CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT10</name>
              <description>External Interrupt 10 CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT11</name>
              <description>External Interrupt 11 CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT12</name>
              <description>External Interrupt 12 CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT13</name>
              <description>External Interrupt 13 CPU Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT14</name>
              <description>External Interrupt 14 CPU Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT15</name>
              <description>External Interrupt 15 CPU Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCPUSEL0</name>
          <description>EVSYS Channel Interrupts CPU Select 0</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>Event Channel 0 Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>Event Channel 1 Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2</name>
              <description>Event Channel 2 Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3</name>
              <description>Event Channel 3 Interrupt CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>Event Channel 4 Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>Event Channel 5 Interrupt CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>Event Channel 6 Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>Event Channel 7 Interrupt CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH8</name>
              <description>Event Channel 8 Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH9</name>
              <description>Event Channel 9 Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH10</name>
              <description>Event Channel 10 Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH11</name>
              <description>Event Channel 11 Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRKEI</name>
              <description>Break Input Event Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRKEO</name>
              <description>Break Output Event Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTCTRL</name>
          <description>External Break Control</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable BRK Pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INV</name>
              <description>Invert BRK Pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GLOBMASK</name>
          <description>Global Break Requests Mask</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Master</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
